Билет14/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет14/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет14/src/Documents/РасходнаяНакладная/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Записать();
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыОстатки.Накладная КАК Накладная,
		|	ВзаиморасчетыОстатки.Валюта КАК Валюта,
		|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) КАК Курс
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки(
		|			&МоментВремени,
		|			Контрагент = &Контрагент
		|				И Накладная = ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК ВзаиморасчетыОстатки,
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Валюта",Валюта);

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	     //если есть аванс списывем сначала с него а потом выставляем долг
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		Если Выборка.Курс = 0 Тогда
		    Отказ = Истина;
			Сообщить("не зад валюта");
		КонецЕсли;
		Если Выборка.СуммаОстаток > 0 Тогда
            Если Выборка.СуммаОстаток >= СуммаПоДокументу * Выборка.Курс Тогда
			    //если аванс больше долга
				Движение = Движения.Взаиморасчеты.ДобавитьРасход();
				Движение.Контрагент = Контрагент;
				Движение.Валюта = Справочники.Валюты.РоссийскийРубль;
				Движение.период = Дата;
				Движение.Накладная = Документы.РасходнаяНакладная.ПустаяСсылка();
				Движение.Сумма = СуммаПоДокументу * Выборка.Курс;				
			Иначе
				//списываем весь аванс
				Движение = Движения.Взаиморасчеты.ДобавитьРасход();
				Движение.Контрагент = Контрагент;
				Движение.Валюта = Справочники.Валюты.РоссийскийРубль;
				Движение.период = Дата;
				Движение.Накладная = Документы.РасходнаяНакладная.ПустаяСсылка();
				Движение.Сумма = Выборка.СуммаОстаток;
				//зачисляем долг
				Движение = Движения.Взаиморасчеты.ДобавитьПриход();
				Движение.Контрагент = Контрагент;
				Движение.Валюта = Валюта;
				Движение.период = Дата;
				Движение.Накладная = Ссылка;
				Движение.Сумма = СуммаПоДокументу  - Выборка.СуммаОстаток / Выборка.Курс;
			КонецЕсли;
	

		КонецЕсли;
	
	КонецЕсли;
	
 
	
КонецПроцедуры
